#### Terraform Plan 📝`success`

Monthly cost estimate: 0 USD

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws-basic-network.aws_subnet.private_subnet["ca-central-1a"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ca-central-1"
      + tags                                           = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Private Subnet - ca-central-1a"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + tags_all                                       = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Private Subnet - ca-central-1a"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws-basic-network.aws_subnet.private_subnet["ca-central-1b"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ca-central-1"
      + tags                                           = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Private Subnet - ca-central-1b"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + tags_all                                       = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Private Subnet - ca-central-1b"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws-basic-network.aws_subnet.private_subnet["ca-central-1c"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.23.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ca-central-1"
      + tags                                           = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Private Subnet - ca-central-1c"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + tags_all                                       = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Private Subnet - ca-central-1c"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws-basic-network.aws_subnet.public_subnet["ca-central-1a"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ca-central-1"
      + tags                                           = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Public Subnet - ca-central-1a"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + tags_all                                       = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Public Subnet - ca-central-1a"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws-basic-network.aws_subnet.public_subnet["ca-central-1b"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ca-central-1"
      + tags                                           = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Public Subnet - ca-central-1b"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + tags_all                                       = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Public Subnet - ca-central-1b"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws-basic-network.aws_subnet.public_subnet["ca-central-1c"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ca-central-1"
      + tags                                           = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Public Subnet - ca-central-1c"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + tags_all                                       = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp Public Subnet - ca-central-1c"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws-basic-network.aws_vpc.network_fundamentals_vpc will be created
  + resource "aws_vpc" "network_fundamentals_vpc" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ca-central-1"
      + tags                                 = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp VPC"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
      + tags_all                             = {
          + "BoundedContext" = "Network Fundatmentals Bootcamp"
          + "Environment"    = "Staging"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "Networking Fundatamental Bootcamp VPC"
          + "Owner"          = "ExamPro.co"
          + "Region"         = "ca-central-1"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>